In [9]:
import pandas as pd

In [10]:
#eb = Entertainer basic table
#ebt = Entertainer breakthrough
#el = Entertainer lastwork

In [11]:
file_path = r'C:\Users\Lenovo\Desktop\Jupyter\Entertainer - Basic Info.xlsx'

In [12]:
eb = pd.read_excel(file_path)

In [13]:
eb.head()

       Entertainer Gender (traditional)  Birth Year
0            Adele                    F        1988
1   Angelina Jolie                    F        1975
2  Aretha Franklin                    F        1942
3      Bette Davis                    F        1908
4      Betty White                    F        1922

In [14]:
file_path = r'C:\Users\Lenovo\Desktop\Jupyter\Entertainer - Breakthrough Info.xlsx'

In [16]:
ebt = pd.read_excel(file_path)

In [17]:
ebt.drop('Entertainer',inplace=True,axis=1)

In [18]:
ebt.head()

,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,2008,19,2009.0
1,1999,"Girl, Interrupted",1999.0
2,1967,I Never Loved a Man (The Way I Love You),1968.0
3,1934,Of Human Bondage,1935.0
4,1952,Life with Elilzabeth,1976.0

In [19]:
file_path = r'C:\Users\Lenovo\Desktop\Jupyter\Entertainer - Last work Info.xlsx'

In [20]:
el = pd.read_excel(file_path)

In [21]:
el.drop('Entertainer',inplace=True,axis=1)

In [22]:
el.head()

   Year of Last Major Work (arguable)  Year of Death
0                                2016            NaN
1                                2016            NaN
2                                2014            NaN
3                                1989         1989.0
4                                2016            NaN

In [23]:
#concating the first two tables (eb and ebt)

In [24]:
main1 = pd.concat([eb,ebt],axis=1)

In [25]:
main1.head()

,Entertainer,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy
0,Adele,2008,19,2009.0,2008,19,2009.0
1,Angelina Jolie,1999,"Girl, Interrupted",1999.0,1999,"Girl, Interrupted",1999.0
2,Aretha Franklin,1967,I Never Loved a Man (The Way I Love You),1968.0,1967,I Never Loved a Man (The Way I Love You),1968.0
3,Bette Davis,1934,Of Human Bondage,1935.0,1934,Of Human Bondage,1935.0
4,Betty White,1952,Life with Elilzabeth,1976.0,1952,Life with Elilzabeth,1976.0

In [26]:
main=pd.concat([main1,el],axis=1)

In [27]:
main.head()

,Entertainer,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Breakthrough/#1 Hit/Award Nomination,Breakthrough Name,Year of First Oscar/Grammy/Emmy,Year of Last Major Work (arguable),Year of Death
0,Adele,2008,19,2009.0,2008,19,2009.0,2016,NaN
1,Angelina Jolie,1999,"Girl, Interrupted",1999.0,1999,"Girl, Interrupted",1999.0,2016,NaN
2,Aretha Franklin,1967,I Never Loved a Man (The Way I Love You),1968.0,1967,I Never Loved a Man (The Way I Love You),1968.0,2014,NaN
3,Bette Davis,1934,Of Human Bondage,1935.0,1934,Of Human Bondage,1935.0,1989,1989.0
4,Betty White,1952,Life with Elilzabeth,1976.0,1952,Life with Elilzabeth,1976.0,2016,NaN

In [28]:
#saving file into excel

In [29]:
new_file = 'FINAL_DATA.xlsx'

In [30]:
main.to_excel(new_file)